{"club_info": {"cal poly game development": {"contact_email:": "kpidding@cpgd.org", "homepage:": "www.cpgd.org", "description:": "Cal Poly Game Development provides resources and discussion for programmers and artists interested in creating games. CPGD welcomes developers and artists of all experience levels.", "contact_phone:": "2066053687", "type(s):": "Special Interest", "advisor:": "Foaad Khosmood", "contact_person:": "Kyle Piddington", "box:": "196", "advisor_email:": "foaad@calpoly.edu", "advisor_phone:": "8057562911", "affiliation:": "None"}, "association for computing machinery": {"contact_email:": "acm.calpoly@gmail.com", "homepage:": "None", "description:": "Association for Computing Machinery is a professional computing club for students in related fields. We are a corporate and social club that caters to Computer Science and Software related companies that want to come to Cal Poly, and we additionally host events that will support students.", "contact_phone:": "9166900646", "type(s):": "Professional, Academic", "advisor:": "Ignatios Vakalis", "contact_person:": "Michelle Lam", "box:": "203", "advisor_email:": "ivakalis@calpoly.edu", "advisor_phone:": "8057565627", "affiliation:": "Engineering, College of"}, "white hat": {"contact_email:": "whitehatcalpoly@gmail.com", "homepage:": "thewhitehat.club", "description:": "White Hat's mission is to provide the tools, knowledge, skills and resources to make the internet a safer place by protecting personal computers, private data and information systems. We make security available and approachable to all individuals and promote an environment to pursue these inter", "contact_phone:": "9167471741", "type(s):": "Academic, Special Interest", "advisor:": "Zachary Peterson", "contact_person:": "Nathan Lemay", "box:": "10", "advisor_email:": "znjp@calpoly.edu", "advisor_phone:": "8057562088", "affiliation:": "Engineering, College of"}, "society of women engineers": {"contact_email:": "cpswepresident@gmail.com", "homepage:": "https://swe.calpoly.edu/", "description:": "The Society of Women Engineers works to promote diversity and support women in engineering, while also providing many academic and professional opportunities to all students.", "contact_phone:": "4807077320", "type(s):": "Professional, Academic, Community Service", "advisor:": "Helene Finger", "contact_person:": "Victoria Spencer", "box:": "162", "advisor_email:": "hfinger@calpoly.edu", "advisor_phone:": "8057562350", "affiliation:": "Engineering, College of"}, "data science": {"contact_email:": "jrernst@calpoly.edu", "homepage:": "None", "description:": "The Cal Poly Data Science Club was established as a consortium for students to apply their knowledge and skills in the extraction of knowledge from various data.", "contact_phone:": "8587355364", "type(s):": "Academic", "advisor:": "Andrew Schaffner", "contact_person:": "Jeff Ernst", "box:": "78", "advisor_email:": "aschaffn@calpoly.edu", "advisor_phone:": "8057561545", "affiliation:": "Math & Science, College of"}}, "tutors": {"Nupur Garg": {"description": "My name is Nupur and I am a fourth year computer science 4+1 student. I   fell in love with programming after taking a Lego robotics summer class   during middle school and my passion for the field has continued to grow ever   since. I enjoy exploring the different disciplines within computer science   and have held internships in mobile development, web development and   networks. Outside of computer science, I religiously watch Ellen and Modern   Family, and I love trying new ethnic (and vegetarian) cuisines."}, "Clint Staley": {"description": "Dr. Staley is the the advisor to the tutoring center."}, "Kendall Gassner": {"description": "Hi, I am a third year computer science major from Sacramento! I began   programming my senior year of high school and haven’t stopped since.  I have   always been fascinated with complicated puzzles. Computer science is a way   to utilize my interest in problem solving and create something practical.  I   am currently programming for MINDBODY, and could not be happier. My other   interests include painting and tennis."}, "Daniel Kauffman": {"description": "I'm a computer science graduate student from San Francisco. I have a BA   in Linguistics from UC Berkeley and have worked as a language lab technician   at an international school in London and as an elementary school English   teacher in Japan. I have discovered a passion for education through my   travels and am now working toward a master's degree to teach high school in   the future. Daniel currently works as a researcher on the natural language   processing team at Digital Democracy. When I'm not on campus I enjoy   spending my time most with my wife and our son."}, "Dylan Howell": {"description": "I am an undergrad in Computer Science from a little town called Colfax,   CA. I originally came to Poly as an Art and Design Major, but my love for   technical fields led me to make the switch into the College of Engineering.   I found my home in CS because of its application through almost any   industry, which allows me to go wherever my interests take me. Outside of   coding, I still hold onto my old passions of art and photography, and often   take to exploring the outdoors and rock climbing any chance I get."}, "Michelle Lam": {"description": "I'm Michelle, and I'm a 3rd year CS student from Sacramento, CA. I came   into Cal Poly with no programming knowledge, but I've (hopefully and)   quickly caught up! I am a giant foodie, and I've been using my internships   in the major to gauge the quality of food at different tech hubs (so far,   San Diego has some bomb adobada tacos, and the soon-to-be Bay Area provides   some promising and long-lost Asian food back to my palate.) My area of   interest is in computer security, and I look forward to exploring that in   the near future!"}, "Kevin Ly": {"description": "I am a 5th year student pursuing a Masters Degree in Computer Science in   the 4 + 1 Program. I have tutored before, took a break, then got back on   because I enjoy tutoring. During my stay here in CP, my greatest   accomplishment was being involved in the construction of a 2.5 dimensional   CNC router to etch letters onto pieces of woods to make trail signs. If I am   your tutor, I'll be sure to give you some tips and tricks especially with   the VIM editor! What I like to do for fun is play console and computer   games, experiment with new cooking recipes, and watch science-y YouTube   videos."}, "Jasper Kahn": {"description": "Hi, I’m Jasper Kahn and I’m a second year Computer Science major from San   Jose, California. I started programming through a survey of computer science   course at my high school, and decided it was for me after an internship with   my dad’s startup. I like the problem solving and creative power of   programming, and being involved in new technology. Last summer I worked for   a startup developing mobile apps for trade shows and other events. For fun,   I read mysteries and sci-fi, play Xbox, and browse reddit."}, "Melinda Lam": {"description": "Hello! My name is Melinda and I use they/them/their pronouns. I am an   undergraduate student majoring in Computer Science and minoring in Women’s   and Gender Studies. I became interested in Computer Science when I took a   programming class in high school. Since then, some topics I’ve become   interested in include operating systems, networks, distributed computing,   programming languages, and compilers; all of which I enjoy because I love   the challenge of thinking about how to build things well and how to manage   something that has been built. Outside of Computer Science, I enjoy playing   with my ukulele, dancing, and going outdoors.      I am also extremely concerned with issues of diversity and inclusivity, so   if you have any questions about being MOGAI/LGBTQIA+ in tech or in general,    please feel free to contact me (my cal poly username is mlam07)."}, "Lana Hodzic": {"description": "Hi, my name is Lana and I'm a fifth year Computer Science major in the   4+1 program. I became interested in Computer Science through my father who   taught me how to program a little turtle to move across the screen and then   convinced me to take a class in high school. Since then I have been in love   with programming. Aside from programming, I am a part of the Cal Poly   Symphony, enjoy being active by spending time outside hiking or biking."}, "Brian Jones": {"description": "Hi, I’m a mathematics graduate student and computer science minor. I   started with computer science my 2nd year at Cal Poly and really enjoyed it.   I really enjoy the more theoretical side of programming, namely algorithms   and programming language theory. In my spare time I tend to be drinking   coffee."}, "Katelyn Hicks": {"description": "Hi, my name’s Katelyn and I am a fourth year majoring in Computer   Science. I grew up in Bakersfield, CA and did not have any programming   experience prior to Cal Poly, but I could not have chosen a better major. I   have a passion for graphics and I look forward to gaining more experience in   that area this summer at Apple. When I’m not programming, it's not odd to   see me consuming a large amount of coffee, exploring the beautiful central   coast and great hiking trails around SLO, or doodling on spare pieces of   paper."}}, "study_session": {"telephone": "805-756-5723", "location": "Study Session\nKennedy Library 112\nCalifornia Polytechnic State University\nSan Luis Obispo, CA 93407-0204", "program_assistant": "Britney Luoma", "description": "Study Session forms study groups for students who submit a request to study with a group focused on challenging, selected courses in the Colleges of Science and Math and the College of Engineering. Each group is led by an upper-division student  and meets twice weekly throughout the quarter. Not for academic credit.", "email": "studysession@calpoly.edu", "coordinator": "Bill Sydnor (Interim)"}, "tutor_info": {"TUTOR_INFO": {"choclate": "good"}}}
